# пример настройки логера
import logging

logging.basicConfig(level=logging.DEBUG, filename = 'py_log.log', filemode='w', encoding='utf-8', format="[%(asctime)s] [%(levelname)s]:{ %(message)s}")
logging.debug('(10): самый низкий уровень логирования, предназначенный для отладочных сообщений, для вывода диагностической информации о приложении.')
logging.info('(20): этот уровень предназначен для вывода данных о фрагментах кода, работающих так, как ожидается.')
logging.warning('(30): этот уровень логирования предусматривает вывод предупреждений, он применяется для записи сведений о событиях, на которые программист обычно обращает внимание. Такие события вполне могут привести к проблемам при работе приложения. Если явно не задать уровень логирования — по умолчанию используется именно warning.')
logging.error('(40): этот уровень логирования предусматривает вывод сведений об ошибках — о том, что часть приложения работает не так как ожидается, о том, что программа не смогла правильно выполниться.')
logging.critical('(50): этот уровень используется для вывода сведений об очень серьёзных ошибках, наличие которых угрожает нормальному функционированию всего приложения. Если не исправить такую ошибку — это может привести к тому, что приложение прекратит работу.')
